#### Terraform Plan (dev) 📖`failure`

<details><summary>Show Plan</summary>

```terraform

data.aws_caller_identity.current: Reading...
aws_internet_gateway.igw: Refreshing state... [id=igw-0fd4da842456aa328]
aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-0e9efdef699832238]
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-0ac6cb5bdf7938923]
data.aws_vpc.conquer-vpc: Reading...
aws_eip.vpc_eip["eu-north-1c"]: Refreshing state... [id=eipalloc-01ba79ee6a348197a]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231029203047953500000004]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231029203047878600000001]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231029203047941200000003]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231029203047927300000002]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231029203048027800000005]
data.aws_vpc.conquer-vpc: Read complete after 1s [id=vpc-080a377054fdb71a7]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-0513255075614361b]
aws_route_table.private_subnet_rt["eu-north-1c"]: Refreshing state... [id=rtb-09367876d27a33ddf]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-03add79dc5b45ae82]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-059e4e6f7154b452d]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-07351fab2592b85a5]
aws_subnet.eks_subnets_private["eu-north-1c"]: Refreshing state... [id=subnet-0ab8d336998f420a4]
aws_subnet.eks_subnets_public["eu-north-1c"]: Refreshing state... [id=subnet-0de8453719844246d]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-02d686d86d66f1169]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-0362d2e0b75497f2b]
aws_nat_gateway.nat_gw["eu-north-1c"]: Refreshing state... [id=nat-0e87f6bc851488569]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-000f283e9a34610e5]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-08aa58fd1f933ee53]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-03fb3d86864917d56]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-0de86b42489e105b9]
aws_route_table_association.private_subnet_rt_association["eu-north-1c"]: Refreshing state... [id=rtbassoc-012aed2e4c70fc569]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-03add79dc5b45ae821080289494]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-07351fab2592b85a51080289494]
aws_route.nat_access["eu-north-1c"]: Refreshing state... [id=r-rtb-09367876d27a33ddf1080289494]
aws_eks_node_group.node-group["eu-north-1c"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-2]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
aws_iam_role.AmazonEKS_EBS_CSI_DriverRole: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole]
aws_iam_openid_connect_provider.eks-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000]
aws_eks_node_group.node-group["eu-north-1a"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-0]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole-2023102920383480890000000e]
aws_eks_addon.aws-ebs-csi-driver: Refreshing state... [id=dev-conquer-cluster:aws-ebs-csi-driver]
helm_release.argocd: Refreshing state... [id=argocd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_eip" "vpc_eip" {
      - allocation_id        = "eipalloc-01ba79ee6a348197a" -> null
      - association_id       = "eipassoc-0bd71e6f2171b73e2" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-01ba79ee6a348197a" -> null
      - network_border_group = "eu-north-1" -> null
      - network_interface    = "eni-0837dba1f38c4a8e4" -> null
      - private_dns          = "ip-10-0-6-56.eu-north-1.compute.internal" -> null
      - private_ip           = "10.0.6.56" -> null
      - public_dns           = "ec2-51-20-169-135.eu-north-1.compute.amazonaws.com" -> null
      - public_ip            = "51.20.169.135" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "dev-conquer-eip-eu-north-1c"
        } -> null
      - tags_all             = {
          - "Name"    = "dev-conquer-eip-eu-north-1c"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc                  = true -> null
    }

  # aws_eks_cluster.eks must be replaced
-/+ resource "aws_eks_cluster" "eks" {
      ~ arn                       = "arn:aws:eks:eu-north-1:014630368052:cluster/dev-conquer-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSzc2WUJzc2F6T0F3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01qa3lNREk1TkRoYUZ3MHpNekV3TWpZeU1ETTBORGhhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUROQzdLeVZFSzk0dDU4YWo2OUp5T0plVXc5QW96aEhxdHVvemdZbzM0K3BjZ1hHOFZxMnpBZlZYUVYKTmNhWlJZbEkwaDYzZHU2UFRHS3FnY3RSTGtpRGE0REtnRmxBaXR5Rm1Fb3YzMTkyWHp3bkRUV0ZlMnNiMDdCSgo5NnRvWHVMN1NuR0p6RVk0ak5NbmpQUzNMYTVHWFBXUUNOdWxuMEZSSHZJbWdlRXNjdExGZ0JBR1RjOXlucjB0CjRlTWwvcC9CODgxUWtyMVJaNFlrWEtsblNrVTlrTVd6YnZlZjdXMXJWNkRVdUdJYWRHYi9BUmJZUnB5cG9Xa04KSGdwSTZ2c3JsZVMxS1RVb25YZnUxazg2MVlxYSt1WnNzR1A1Kzg5QUlTSEYzdzJRMTFqVzUwdUNlNUZnZ1NrZgppZkcwUm1jamwrRzJDTytub0RBeU5SeVQvRFBIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRNWZNYTd4L3JoV29HcmdBWkxHdktMa2dhdW56QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQnJUYUVTMEdYTQpEYUpxOWx0Q29ZS05OVktIcFNZQjFMN0ZxQUVRbW0vRW9DTVhpZnNHRUtYOTFma0xRcjBSZFlpcmg2VWtVRm9rCk1EQXlBOE05N2ZYb0xZMnlvNGQ0WkkyZU1rY1U4VDhuN2xNMTN3QzRBcnVaVTh2MG0zVTh5MTBwZDFnY245RmoKUmNudjlKbnViMEVRbjJvWTRJMmRhR09HdFBlVVlsY0JOQ1JVOG5QSjk3TUJqRHZ0NnBiUi9waXkwV2s3R1IzYQpxZVJMcFUyRTdDcU54cU5ZTnczWm9YUnJGU0sxTjlDclN2Zk1TbDV4TFpsMzFYaXRmQlZ1MUxXQVdISFNxMjZhCmttMjNMb3RuVFJmckt4NVdCd2h2TGFKbE82dEVkQTN1QlJ2Yjl3ZXFwMG9uRG1LNlFuRkwxamdnRjZCLzNVdXMKbnIxZzhaa0pRS3dZCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-10-29 20:30:49.803 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://B476B3D762D8D5E17CAB0BBE80EFB000.yl4.eu-north-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "dev-conquer-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "dev-conquer-cluster"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "ctf" = "WW91IGdvdCBpdCEgbmljZS4="
        }
        # (4 unchanged attributes hidden)

      ~ kubernetes_network_config {
          + service_ipv6_cidr = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-054a774ee919c7ae2" -> (known after apply)
          - security_group_ids        = [] -> null
          ~ subnet_ids                = [ # forces replacement
              - "subnet-0ab8d336998f420a4",
                # (2 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-080a377054fdb71a7" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_eks_node_group" "node-group" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-2/4ac5be94-73b9-47f0-2ac4-9bc3b772d1cb" -> null
      - capacity_type   = "SPOT" -> null
      - cluster_name    = "dev-conquer-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "dev-conquer-cluster:dev-conquer-node-group-2" -> null
      - instance_types  = [
          - "t3.micro",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "dev-conquer-node-group-2" -> null
      - node_role_arn   = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role" -> null
      - release_version = "1.28.1-20231002" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-2-4ac5be94-73b9-47f0-2ac4-9bc3b772d1cb"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-0ab8d336998f420a4",
        ] -> null
      - tags            = {} -> null
      - tags_all        = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - version         = "1.28" -> null

      - scaling_config {
          - desired_size = 3 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_iam_openid_connect_provider.eks-idp must be replaced
-/+ resource "aws_iam_openid_connect_provider" "eks-idp" {
      ~ arn             = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000" -> (known after apply)
      ~ id              = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000" -> (known after apply)
      - tags            = {} -> null
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be updated in-place
  ~ resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "AmazonEKS_EBS_CSI_DriverRole"
        name                  = "AmazonEKS_EBS_CSI_DriverRole"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:eu-north-1:014630368052:internet-gateway/igw-0fd4da842456aa328" -> null
      - id       = "igw-0fd4da842456aa328" -> null
      - owner_id = "014630368052" -> null
      - tags     = {
          - "Name" = "dev-conquer-vpc-igw"
        } -> null
      - tags_all = {
          - "Name"    = "dev-conquer-vpc-igw"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
    }

  # aws_nat_gateway.nat_gw["eu-north-1a"] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-01f5a9cc8ee91ed99" -> (known after apply)
      ~ id                                 = "nat-000f283e9a34610e5" -> (known after apply)
      ~ network_interface_id               = "eni-04f9c467f55ec9f30" -> (known after apply)
      ~ private_ip                         = "10.0.4.196" -> (known after apply)
      ~ public_ip                          = "13.53.215.163" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0362d2e0b75497f2b" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_gw["eu-north-1b"] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-00d30efd2723df1c6" -> (known after apply)
      ~ id                                 = "nat-08aa58fd1f933ee53" -> (known after apply)
      ~ network_interface_id               = "eni-02e2c6cef773cfe9d" -> (known after apply)
      ~ private_ip                         = "10.0.5.31" -> (known after apply)
      ~ public_ip                          = "16.171.101.24" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-059e4e6f7154b452d" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_gw["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_nat_gateway" "nat_gw" {
      - allocation_id                      = "eipalloc-01ba79ee6a348197a" -> null
      - association_id                     = "eipassoc-0bd71e6f2171b73e2" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0e87f6bc851488569" -> null
      - network_interface_id               = "eni-0837dba1f38c4a8e4" -> null
      - private_ip                         = "10.0.6.56" -> null
      - public_ip                          = "51.20.169.135" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-0de8453719844246d" -> null
      - tags                               = {
          - "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
        } -> null
      - tags_all                           = {
          - "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
    }

  # aws_route.nat_access["eu-north-1a"] will be updated in-place
  ~ resource "aws_route" "nat_access" {
        id                     = "r-rtb-07351fab2592b85a51080289494"
      ~ nat_gateway_id         = "nat-000f283e9a34610e5" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route.nat_access["eu-north-1b"] will be updated in-place
  ~ resource "aws_route" "nat_access" {
        id                     = "r-rtb-03add79dc5b45ae821080289494"
      ~ nat_gateway_id         = "nat-08aa58fd1f933ee53" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route.nat_access["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route" "nat_access" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-09367876d27a33ddf1080289494" -> null
      - nat_gateway_id         = "nat-0e87f6bc851488569" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-09367876d27a33ddf" -> null
      - state                  = "active" -> null
    }

  # aws_route_table.private_subnet_rt["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route_table" "private_subnet_rt" {
      - arn              = "arn:aws:ec2:eu-north-1:014630368052:route-table/rtb-09367876d27a33ddf" -> null
      - id               = "rtb-09367876d27a33ddf" -> null
      - owner_id         = "014630368052" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0e87f6bc851488569"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "dev-conquer-nat-eu-north-1c-rt"
        } -> null
      - tags_all         = {
          - "Name"    = "dev-conquer-nat-eu-north-1c-rt"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id           = "vpc-080a377054fdb71a7" -> null
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route_table_association" "private_subnet_rt_association" {
      - id             = "rtbassoc-012aed2e4c70fc569" -> null
      - route_table_id = "rtb-09367876d27a33ddf" -> null
      - subnet_id      = "subnet-0ab8d336998f420a4" -> null
    }

  # aws_subnet.eks_subnets_private["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_subnet" "eks_subnets_private" {
      - arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-0ab8d336998f420a4" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1c" -> null
      - availability_zone_id                           = "eun1-az3" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ab8d336998f420a4" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "014630368052" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "dev-conquer-private_subnet_eu-north-1c"
          - "Tier" = "Private"
        } -> null
      - tags_all                                       = {
          - "Name"    = "dev-conquer-private_subnet_eu-north-1c"
          - "Tier"    = "Private"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id                                         = "vpc-080a377054fdb71a7" -> null
    }

  # aws_subnet.eks_subnets_public["eu-north-1a"] must be replaced
-/+ resource "aws_subnet" "eks_subnets_public" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-0362d2e0b75497f2b" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0362d2e0b75497f2b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "014630368052" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "dev-conquer-public_subnet_eu-north-1a"
            "Tier" = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.eks_subnets_public["eu-north-1b"] must be replaced
-/+ resource "aws_subnet" "eks_subnets_public" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-059e4e6f7154b452d" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-059e4e6f7154b452d" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "014630368052" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "dev-conquer-public_subnet_eu-north-1b"
            "Tier" = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.eks_subnets_public["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_subnet" "eks_subnets_public" {
      - arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-0de8453719844246d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1c" -> null
      - availability_zone_id                           = "eun1-az3" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0de8453719844246d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "014630368052" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "dev-conquer-public_subnet_eu-north-1c"
          - "Tier" = "Public"
        } -> null
      - tags_all                                       = {
          - "Name"    = "dev-conquer-public_subnet_eu-north-1c"
          - "Tier"    = "Public"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id                                         = "vpc-080a377054fdb71a7" -> null
    }

Plan: 6 to add, 3 to change, 15 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://B476B3D762D8D5E17CAB0BBE80EFB000.yl4.eu-north-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = (sensitive value)
  ~ oidc-issuer                           = [
      - {
          - oidc = [
              - {
                  - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/B476B3D762D8D5E17CAB0BBE80EFB000"
                },
            ]
        },
    ] -> (known after apply)

```

</details>

*Pusher: @benhur-araujo, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*